In [1]:
import pandas as pd

In [2]:
groceries = pd.Series(data=[1, 2, 'Yes'], index=['egg', 'apples', 'milk'])
groceries

egg         1
apples      2
milk      Yes
dtype: object

In [3]:
groceries.shape

(3,)

In [4]:
groceries.ndim

1

In [5]:
groceries.size

3

In [6]:
groceries.index

Index(['egg', 'apples', 'milk'], dtype='object')

In [7]:
groceries.values

array([1, 2, 'Yes'], dtype=object)

In [8]:
'egg' in groceries

True

In [9]:
groceries[['egg', 'milk']] = 2, 'No'

In [10]:
groceries

egg        2
apples     2
milk      No
dtype: object

In [11]:
groceries[[0, -1]]

egg      2
milk    No
dtype: object

In [12]:
groceries.drop('egg', inplace=True)

In [13]:
groceries

apples     2
milk      No
dtype: object

In [14]:
items = {'Bob':pd.Series(data=[1,1,'Yes'], index=['egg','apple','bp']),
        'Alis':pd.Series(data=[2,2,'No'], index=['egg','apple','bp'])}

In [15]:
df = pd.DataFrame(items)
df

       Bob Alis
egg      1    2
apple    1    2
bp     Yes   No

In [16]:
df.index

Index(['egg', 'apple', 'bp'], dtype='object')

In [17]:
df.columns

Index(['Bob', 'Alis'], dtype='object')

In [18]:
df.shape

(3, 2)

In [19]:
Bob_df = pd.DataFrame(items, columns=['Bob'])
Bob_df

       Bob
egg      1
apple    1
bp     Yes

In [20]:
df[['Bob']]

       Bob
egg      1
apple    1
bp     Yes

In [21]:
df.loc[['egg']]

    Bob Alis
egg   1    2

In [22]:
df['Cat'] = [15, 10, 'Yes']
df

       Bob Alis  Cat
egg      1    2   15
apple    1    2   10
bp     Yes   No  Yes

In [23]:
df['tot'] = df['Bob'] + df['Alis'] + df['Cat']
df

       Bob Alis  Cat       tot
egg      1    2   15        18
apple    1    2   10        13
bp     Yes   No  Yes  YesNoYes

In [24]:
new_item_dic = {'Bob': 5, 'Alis':5, 'Cat':5, 'tot':15}
df_new = pd.DataFrame(new_item_dic, index= ['bread'])

df = df.append(df_new)

In [25]:
df

       Bob Alis  Cat       tot
egg      1    2   15        18
apple    1    2   10        13
bp     Yes   No  Yes  YesNoYes
bread    5    5    5        15

In [26]:
df.pop('tot')

egg            18
apple          13
bp       YesNoYes
bread          15
Name: tot, dtype: object

In [27]:
df

       Bob Alis  Cat
egg      1    2   15
apple    1    2   10
bp     Yes   No  Yes
bread    5    5    5

In [28]:
df = df.drop(['Cat'], axis=1)
df

       Bob Alis
egg      1    2
apple    1    2
bp     Yes   No
bread    5    5

In [29]:
df = df.drop(['bp'], axis=0)
df

      Bob Alis
egg     1    2
apple   1    2
bread   5    5

In [30]:
items = [{'bikes': 1, 'pants':5, 'watches':2}, {'watches': 2, 'glasses':1, 'bikes':2, 'pants':4}]
df = pd.DataFrame(items)
df

   bikes  glasses  pants  watches
0      1      NaN      5        2
1      2      1.0      4        2

In [31]:
df[['bikes']]

   bikes
0      1
1      2

In [32]:
df.loc[[0]]

   bikes  glasses  pants  watches
0      1      NaN      5        2

In [33]:
df.iloc[[0]]

   bikes  glasses  pants  watches
0      1      NaN      5        2

In [34]:
df['suits'] = df['pants']-2

In [35]:
df

   bikes  glasses  pants  watches  suits
0      1      NaN      5        2      3
1      2      1.0      4        2      2

In [36]:
dic = [{'bike':2, 'glass': 4, 'table': 2, 'piano':1},
      {'bike':4, 'glass': 1, 'table': 1, 'guitar':1},
      {'bike':3, 'glass': 2, 'table': 2}]

In [37]:
df = pd.DataFrame(dic)

In [38]:
df

   bike  glass  guitar  piano  table
0     2      4     NaN    1.0      2
1     4      1     1.0    NaN      1
2     3      2     NaN    NaN      2

In [39]:
df.isnull()

    bike  glass  guitar  piano  table
0  False  False    True  False  False
1  False  False   False   True  False
2  False  False    True   True  False

In [40]:
df.isnull().sum()

bike      0
glass     0
guitar    2
piano     2
table     0
dtype: int64

In [41]:
df.isnull().sum().sum()

4

In [42]:
print(df)
df.dropna(axis=0)

   bike  glass  guitar  piano  table
0     2      4     NaN    1.0      2
1     4      1     1.0    NaN      1
2     3      2     NaN    NaN      2

Empty DataFrame
Columns: [bike, glass, guitar, piano, table]
Index: []

In [43]:
df.dropna(axis=1)

   bike  glass  table
0     2      4      2
1     4      1      1
2     3      2      2

In [44]:
df['piano'] = df['piano'].fillna(df['piano'].mean())

In [45]:
df

   bike  glass  guitar  piano  table
0     2      4     NaN    1.0      2
1     4      1     1.0    1.0      1
2     3      2     NaN    1.0      2

In [48]:
df = pd.read_csv('GOOG.csv')
df.head()

         Date       Open       High        Low      Close  Adj Close    Volume
0  2004-08-19  49.676899  51.693783  47.669952  49.845802  49.845802  44994500
1  2004-08-20  50.178635  54.187561  49.925285  53.805050  53.805050  23005800
2  2004-08-23  55.017166  56.373344  54.172661  54.346527  54.346527  18393200
3  2004-08-24  55.260582  55.439419  51.450363  52.096165  52.096165  15361800
4  2004-08-25  52.140873  53.651051  51.604362  52.657513  52.657513   9257400

In [49]:
df.isnull().sum()

Date         0
Open         0
High         0
Low          0
Close        0
Adj Close    0
Volume       0
dtype: int64

In [52]:
df.describe()

,Open,High,Low,Close,Adj Close,Volume
count,3313.000000,3313.000000,3313.000000,3313.000000,3313.000000,3.313000e+03
mean,380.186092,383.493740,376.519309,380.072458,380.072458,8.038476e+06
std,223.818650,224.974534,222.473232,223.853780,223.853780,8.399521e+06
min,49.274517,50.541279,47.669952,49.681866,49.681866,7.900000e+03
25%,226.556473,228.394516,224.003082,226.407440,226.407440,2.584900e+06
50%,293.312286,295.433502,289.929291,293.029114,293.029114,5.281300e+06
75%,536.650024,540.000000,532.409973,536.690002,536.690002,1.065370e+07
max,992.000000,997.210022,989.000000,989.679993,989.679993,8.276810e+07

In [53]:
df.corr()

               Open      High       Low     Close  Adj Close    Volume
Open       1.000000  0.999904  0.999845  0.999745   0.999745 -0.564258
High       0.999904  1.000000  0.999834  0.999868   0.999868 -0.562749
Low        0.999845  0.999834  1.000000  0.999899   0.999899 -0.567007
Close      0.999745  0.999868  0.999899  1.000000   1.000000 -0.564967
Adj Close  0.999745  0.999868  0.999899  1.000000   1.000000 -0.564967
Volume    -0.564258 -0.562749 -0.567007 -0.564967  -0.564967  1.000000

In [54]:
df.head()

         Date       Open       High        Low      Close  Adj Close    Volume
0  2004-08-19  49.676899  51.693783  47.669952  49.845802  49.845802  44994500
1  2004-08-20  50.178635  54.187561  49.925285  53.805050  53.805050  23005800
2  2004-08-23  55.017166  56.373344  54.172661  54.346527  54.346527  18393200
3  2004-08-24  55.260582  55.439419  51.450363  52.096165  52.096165  15361800
4  2004-08-25  52.140873  53.651051  51.604362  52.657513  52.657513   9257400

In [ ]:
# df.groupby(['year', 'dept'])['salary'].sum()